//** @file
//   Strings for Memory Information DXE
//
//;******************************************************************************
//;* Copyright (c) 2024, Insyde Software Corp. All Rights Reserved.
//;*
//;* You may not reproduce, distribute, publish, display, perform, modify, adapt,
//;* transmit, broadcast, present, recite, release, license or otherwise exploit
//;* any part of this publication in any form, by any means, without the prior
//;* written permission of Insyde Software Corporation.
//;*
//;******************************************************************************

/=#

#include "Standard.uni"

#string STR_BLANK_STRING                                         #language en-US " "

#string STR_MEMORY_INFO_FORMSET                                  #language en-US "Memory Information"
#string STR_MEMORY_INFO_FORMSET_HELP                             #language en-US "Memory Information"

#string STR_MEMORY_DETAIL_INFO_FORMSET                           #language en-US "Memory Dimm Information"
#string STR_MEMORY_DETAIL_INFO_FORMSET_HELP                      #language en-US "More Memory Detail Information"
#string STR_MEMORY_LOCATOR_TITLE                                 #language en-US "Memory Locator"
#string STR_MEMORY_SLOT_STRING                                   #language en-US "Memory Slots"
#string STR_TOTAL_OF_MEMORY_SLOT_STRING                          #language en-US "0 Memory Slot"
#string STR_NUMBER_OF_MEMORY_INSTALLED_STRING                    #language en-US "0 Memory Installed"
#string STR_NUMBER_OF_MEMORY_UNINSTALL_STRING                    #language en-US "0 Memory Uninstall"
#string STR_MEMORY_STRING                                        #language en-US "Memory "
#string STR_MEMORIES_STRING                                      #language en-US "Memories "
#string STR_INSTALLED_STRING                                     #language en-US "Installed"
#string STR_NOT_INSTALLED_STRING                                 #language en-US "Not Installed"
#string STR_HIDDEN_NOT_INSTALLED_MEMORY_PROMPT                   #language en-US "Hidden Not Installed Memory"
#string STR_HIDDEN_NOT_INSTALLED_MEMORY_HELP                     #language en-US "CheckBox[X] = Hidden Not Installed Memory, CheckBox[ ] = Show All Memory"
#string STR_ECC_TYPE_PROMPT                                      #language en-US "Memory Error Correction Types"
#string STR_ECC_TYPE_STRING                                      #language en-US "None (Memory Not Installed)"
#string STR_ECC_TYPE_HELP                                        #language en-US "Memory Array — Error Correction Types"
#string STR_TOTAL_MEMORY_SIZEE_PROMPT                            #language en-US "Total Memory Size"
#string STR_TOTAL_MEMORY_SIZE_STRING                             #language en-US "0 MB (0 GB)"
#string STR_TOTAL_MEMORY_SIZE_HELP                               #language en-US "Total memory size in the system"  

#string STR_DIMM_PROMPT                                          #language en-US "Device Locator"
#string STR_CHANNEL_PROMPT                                       #language en-US "Bank Locator"
#string STR_MANUFACTURER_PROMPT                                  #language en-US "Manufacture"
#string STR_MEMORY_TYPE_PROMPT                                   #language en-US "Memory Type"
#string STR_DRAM_TYPE_PROMPT                                     #language en-US "DRAM Type"
#string STR_SERIAL_NO_PROMPT                                     #language en-US "Serial Number"
#string STR_PART_NO_PROMPT                                       #language en-US "Part Number"
#string STR_MEMORY_SIZE_PROMPT                                   #language en-US "Memory Size"
#string STR_MAXIMUM_MEMORY_SPEED_PROMPT                          #language en-US "Maximum Capable Memory Speed"
#string STR_CONFIG_MEMORY_SPEED_PROMPT                           #language en-US "Configured Memory Speed"
#string STR_CONFIG_VOLTAGE_PROMPT                                #language en-US "Configured Voltage"

#string STR_DIMM_STRING                                          #language en-US "TBD"
#string STR_CHANNEL_STRING                                       #language en-US "TBD"
#string STR_MANUFACTURER_STRING                                  #language en-US "TBD"
#string STR_MEMORY_TYPE_STRING                                   #language en-US "TBD"
#string STR_DRAM_TYPE_STRING                                     #language en-US "TBD"
#string STR_SERIAL_NO_STRING                                     #language en-US "TBD"
#string STR_PART_NO_STRING                                       #language en-US "TBD"
#string STR_MEMORY_SIZE_STRING                                   #language en-US "TBD"
#string STR_MAXIMUM_MEMORY_SPEED_STRING                          #language en-US "TBD"
#string STR_CONFIG_MEMORY_SPEED_STRING                           #language en-US "TBD"
#string STR_CONFIG_VOLTAGE_STRING                                #language en-US "TBD"

#string STR_DIMM_HELP                                            #language en-US "String number of the string that identifies the "
                                                                                 "physically-labeled socket or board position where "
                                                                                 "the memory device is located."
#string STR_CHANNEL_HELP                                         #language en-US "String number of the string that identifies the "
                                                                                 "physically labeled bank where the memory device is "
                                                                                 "located."
#string STR_MANUFACTURER_HELP                                    #language en-US "String number for the manufacturer of this memory device."
#string STR_MEMORY_TYPE_HELP                                     #language en-US "Type of memory used in this device."
#string STR_DRAM_TYPE_HELP                                       #language en-US "Additional detail on the memory device type."
#string STR_SERIAL_NO_HELP                                       #language en-US "String number for the serial number of this memory device.\n"
                                                                                 "This value is set by the manufacturer and normally is not changeable."
#string STR_PART_NO_HELP                                         #language en-US "String number for the part number of this memory device.\n"
                                                                                 "This value is set by the manufacturer and normally is not changeable."
#string STR_MEMORY_SIZE_HELP                                     #language en-US "Memory devices smaller than (32 GB - 1 MB) should be represented using their size in the Size field, "
                                                                                 "leaving the Extended Size field set to 0.\n"
                                                                                 "The Extended Size field is intended to represent memory devices larger than 32,767 MB (32 GB - 1 MB), "
                                                                                 "which cannot be described using the Size field."
#string STR_MAXIMUM_MEMORY_SPEED_HELP                            #language en-US "Identifies the maximum capable speed of the device, in megatransfers per second (MT/s)."
#string STR_CONFIG_MEMORY_SPEED_HELP                             #language en-US "Identifies the configured speed of the memory device, in megatransfers per second (MT/s)." 
#string STR_CONFIG_VOLTAGE_HELP                                  #language en-US "Configured voltage for this device, in millivolts."

#string STR_NONE_MEMORY_NOT_INSTALLED                            #language en-US "None (Memory Not Installed)"
#string STR_UNKNOWN                                              #language en-US "Unknown"

//
// End of file
//
